local api = vim.api
local utils = require('dashboard.utils')

local function week_ascii_text()
  return {
    ['Monday'] = {
      '',
      '',
      'Aɴᴅ ɪɴ ᴛʜᴇ sɪxᴛʜ ᴍᴏɴᴛʜ ᴛʜᴇ',
      ' █████╗ ███╗  ██╗ ██████╗ ███████╗██╗        ██████╗  █████╗ ██████╗ ██████╗ ██╗███████╗██╗     ',
      '██╔══██╗████╗ ██║██╔════╝ ██╔════╝██║       ██╔════╝ ██╔══██╗██╔══██╗██╔══██╗██║██╔════╝██║     ',
      '███████║██╔██╗██║██║  ██╗ █████╗  ██║       ██║  ██╗ ███████║██████╦╝██████╔╝██║█████╗  ██║     ',
      '██╔══██║██║╚████║██║  ╚██╗██╔══╝  ██║       ██║  ╚██╗██╔══██║██╔══██╗██╔══██╗██║██╔══╝  ██║     ',
      '██║  ██║██║ ╚███║╚██████╔╝███████╗███████╗  ╚██████╔╝██║  ██║██████╦╝██║  ██║██║███████╗███████╗',
      '╚═╝  ╚═╝╚═╝  ╚══╝ ╚═════╝ ╚══════╝╚══════╝   ╚═════╝ ╚═╝  ╚═╝╚═════╝ ╚═╝  ╚═╝╚═╝╚══════╝╚══════╝',
      'ᴡᴀs sᴇɴᴛ ғʀᴏᴍ Gᴏᴅ ᴜɴᴛᴏ ᴀ ᴄɪᴛʏ ᴏғ Gᴀʟɪʟᴇᴇ, ɴᴀᴍᴇᴅ Nᴀᴢᴀʀᴇᴛʜ,',
      "To a virgin espoused to a man whose name was Joseph, of the house of David; and the virgin's name was Mary.",
      '(Luke 1:26-27)',
      '',
      '',
      '',
      '',
    },
    ['Tuesday'] = {
      '',
      '',
      '',
      ' █████╗ ███╗  ██╗██████╗   ████████╗██╗  ██╗███████╗   █████╗ ███╗  ██╗ ██████╗ ███████╗██╗     ',
      '██╔══██╗████╗ ██║██╔══██╗  ╚══██╔══╝██║  ██║██╔════╝  ██╔══██╗████╗ ██║██╔════╝ ██╔════╝██║     ',
      '███████║██╔██╗██║██║  ██║     ██║   ███████║█████╗    ███████║██╔██╗██║██║  ██╗ █████╗  ██║     ',
      '██╔══██║██║╚████║██║  ██║     ██║   ██╔══██║██╔══╝    ██╔══██║██║╚████║██║  ╚██╗██╔══╝  ██║     ',
      '██║  ██║██║ ╚███║██████╔╝     ██║   ██║  ██║███████╗  ██║  ██║██║ ╚███║╚██████╔╝███████╗███████╗',
      '╚═╝  ╚═╝╚═╝  ╚══╝╚═════╝      ╚═╝   ╚═╝  ╚═╝╚══════╝  ╚═╝  ╚═╝╚═╝  ╚══╝ ╚═════╝ ╚══════╝╚══════╝',
      'ᴄᴀᴍᴇ ɪɴ ᴜɴᴛᴏ ʜᴇʀ, ᴀɴᴅ sᴀɪᴅ, Hᴀɪʟ, ᴛʜᴏᴜ ᴛʜᴀᴛ ᴀʀᴛ ʜɪɢʜʟʏ',
      'favoured, the Lord is with thee: blessed art thou among women. (Luke 1:28)',
      '',
    },
    ['Wednesday'] = {
      '',
      '',
      '',
      ' █████╗ ███╗  ██╗██████╗    ██╗       ██╗██╗  ██╗███████╗███╗  ██╗   ██████╗██╗  ██╗███████╗',
      '██╔══██╗████╗ ██║██╔══██╗   ██║  ██╗  ██║██║  ██║██╔════╝████╗ ██║  ██╔════╝██║  ██║██╔════╝',
      '███████║██╔██╗██║██║  ██║   ╚██╗████╗██╔╝███████║█████╗  ██╔██╗██║  ╚█████╗ ███████║█████╗  ',
      '██╔══██║██║╚████║██║  ██║    ████╔═████║ ██╔══██║██╔══╝  ██║╚████║   ╚═══██╗██╔══██║██╔══╝  ',
      '██║  ██║██║ ╚███║██████╔╝    ╚██╔╝ ╚██╔╝ ██║  ██║███████╗██║ ╚███║  ██████╔╝██║  ██║███████╗',
      '╚═╝  ╚═╝╚═╝  ╚══╝╚═════╝      ╚═╝   ╚═╝  ╚═╝  ╚═╝╚══════╝╚═╝  ╚══╝  ╚═════╝ ╚═╝  ╚═╝╚══════╝',
      'sᴀᴡ ʜɪᴍ, sʜᴇ ᴡᴀs ᴛʀᴏᴜʙʟᴇᴅ ᴀᴛ ʜɪs sᴀʏɪɴɢ, ᴀɴᴅ ᴄᴀsᴛ ɪɴ ʜᴇʀ ᴍɪɴᴅ ᴡʜᴀᴛ ᴍᴀɴɴᴇʀ ᴏғ sᴀʟᴜᴛᴀᴛɪᴏɴ ᴛʜɪs sʜᴏᴜʟᴅ ʙᴇ.',
      'And the angel said unto her, Fear not, Mary: for thou hast found favour with God.',
      'And, behold, thou shalt conceive in thy womb, and bring forth a son, and shalt call his name JESUS. (Luke 1:29-31)',
      '',
    },
    ['Thursday'] = {
      '',
      '',
      '',
      'Hᴇ',
      ' ██████╗██╗  ██╗ █████╗ ██╗     ██╗       ██████╗ ███████╗   ██████╗ ██████╗ ███████╗ █████╗ ████████╗   ',
      '██╔════╝██║  ██║██╔══██╗██║     ██║       ██╔══██╗██╔════╝  ██╔════╝ ██╔══██╗██╔════╝██╔══██╗╚══██╔══╝   ',
      '╚█████╗ ███████║███████║██║     ██║       ██████╦╝█████╗    ██║  ██╗ ██████╔╝█████╗  ███████║   ██║      ',
      ' ╚═══██╗██╔══██║██╔══██║██║     ██║       ██╔══██╗██╔══╝    ██║  ╚██╗██╔══██╗██╔══╝  ██╔══██║   ██║   ██╗',
      '██████╔╝██║  ██║██║  ██║███████╗███████╗  ██████╦╝███████╗  ╚██████╔╝██║  ██║███████╗██║  ██║   ██║   ╚█║',
      '╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝╚══════╝  ╚═════╝ ╚══════╝   ╚═════╝ ╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝   ╚═╝    ╚╝',
      'and shall be called the Son of the Highest:',
      'and the Lord God shall give unto him the throne of his father David:',
      'And he shall reign over the house of Jacob for ever; and of his kingdom there shall be no end. (Luke 1:32-33)',
      '',
      '',
    },
    ['Friday'] = {
      '',
      '',
      '',
      '████████╗██╗  ██╗███████╗███╗  ██╗   ██████╗ █████╗ ██╗██████╗   ███╗   ███╗ █████╗ ██████╗ ██╗   ██╗',
      '╚══██╔══╝██║  ██║██╔════╝████╗ ██║  ██╔════╝██╔══██╗██║██╔══██╗  ████╗ ████║██╔══██╗██╔══██╗╚██╗ ██╔╝',
      '   ██║   ███████║█████╗  ██╔██╗██║  ╚█████╗ ███████║██║██║  ██║  ██╔████╔██║███████║██████╔╝ ╚████╔╝ ',
      '   ██║   ██╔══██║██╔══╝  ██║╚████║   ╚═══██╗██╔══██║██║██║  ██║  ██║╚██╔╝██║██╔══██║██╔══██╗  ╚██╔╝  ',
      '   ██║   ██║  ██║███████╗██║ ╚███║  ██████╔╝██║  ██║██║██████╔╝  ██║ ╚═╝ ██║██║  ██║██║  ██║   ██║   ',
      '   ╚═╝   ╚═╝  ╚═╝╚══════╝╚═╝  ╚══╝  ╚═════╝ ╚═╝  ╚═╝╚═╝╚═════╝   ╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝   ',
      'ᴜɴᴛᴏ ᴛʜᴇ ᴀɴɢᴇʟ, Hᴏᴡ sʜᴀʟʟ ᴛʜɪs ʙᴇ, sᴇᴇɪɴɢ I ᴋɴᴏᴡ ɴᴏᴛ ᴀ ᴍᴀɴ?',
      '(Luke 1:34)',
      '',
    },
    ['Saturday'] = {
      '',
      '',
      '',
      ' █████╗ ███╗  ██╗██████╗   ████████╗██╗  ██╗███████╗   █████╗ ███╗  ██╗ ██████╗ ███████╗██╗     ',
      '██╔══██╗████╗ ██║██╔══██╗  ╚══██╔══╝██║  ██║██╔════╝  ██╔══██╗████╗ ██║██╔════╝ ██╔════╝██║     ',
      '███████║██╔██╗██║██║  ██║     ██║   ███████║█████╗    ███████║██╔██╗██║██║  ██╗ █████╗  ██║     ',
      '██╔══██║██║╚████║██║  ██║     ██║   ██╔══██║██╔══╝    ██╔══██║██║╚████║██║  ╚██╗██╔══╝  ██║     ',
      '██║  ██║██║ ╚███║██████╔╝     ██║   ██║  ██║███████╗  ██║  ██║██║ ╚███║╚██████╔╝███████╗███████╗',
      '╚═╝  ╚═╝╚═╝  ╚══╝╚═════╝      ╚═╝   ╚═╝  ╚═╝╚══════╝  ╚═╝  ╚═╝╚═╝  ╚══╝ ╚═════╝ ╚══════╝╚══════╝',
      'ᴀɴsᴡᴇʀᴇᴅ ᴀɴᴅ sᴀɪᴅ ᴜɴᴛᴏ ʜᴇʀ, Tʜᴇ Hᴏʟʏ Gʜᴏsᴛ sʜᴀʟʟ ᴄᴏᴍᴇ ᴜᴘᴏɴ ᴛʜᴇᴇ,',
      'ᴀɴᴅ ᴛʜᴇ ᴘᴏᴡᴇʀ ᴏғ ᴛʜᴇ Hɪɢʜᴇsᴛ sʜᴀʟʟ ᴏᴠᴇʀsʜᴀᴅᴏᴡ ᴛʜᴇᴇ:',
      'therefore also that holy thing which shall be born of thee shall be called the Son of God.',
      'Luke 1:35',
      '',
    },
    ['Sunday'] = {
      '',
      '',
      '',
      ' █████╗ ███╗  ██╗██████╗   ███╗   ███╗ █████╗ ██████╗ ██╗   ██╗   ██████╗ █████╗ ██╗██████╗    ',
      '██╔══██╗████╗ ██║██╔══██╗  ████╗ ████║██╔══██╗██╔══██╗╚██╗ ██╔╝  ██╔════╝██╔══██╗██║██╔══██╗   ',
      '███████║██╔██╗██║██║  ██║  ██╔████╔██║███████║██████╔╝ ╚████╔╝   ╚█████╗ ███████║██║██║  ██║   ',
      '██╔══██║██║╚████║██║  ██║  ██║╚██╔╝██║██╔══██║██╔══██╗  ╚██╔╝     ╚═══██╗██╔══██║██║██║  ██║██╗',
      '██║  ██║██║ ╚███║██████╔╝  ██║ ╚═╝ ██║██║  ██║██║  ██║   ██║     ██████╔╝██║  ██║██║██████╔╝╚█║',
      '╚═╝  ╚═╝╚═╝  ╚══╝╚═════╝   ╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝     ╚═════╝ ╚═╝  ╚═╝╚═╝╚═════╝  ╚╝',
      'Mʏ sᴏᴜʟ ᴅᴏᴛʜ ᴍᴀɢɴɪғʏ ᴛʜᴇ Lᴏʀᴅ, Aɴᴅ ᴍʏ sᴘɪʀɪᴛ ʜᴀᴛʜ ʀᴇᴊᴏɪᴄᴇᴅ ɪɴ Gᴏᴅ ᴍʏ Sᴀᴠɪᴏᴜʀ.',
      'For he hath regarded the low estate of his handmaiden:',
      'for, behold, from henceforth all generations shall call me blessed. (Luke 1:46-48)',
      '',
    },
  }
end

local function default_header()
  return {
    '',
    '',
    '',
    ' ██████╗  █████╗ ███████╗██╗  ██╗██████╗  ██████╗  █████╗ ██████╗ ██████╗  ',
    ' ██╔══██╗██╔══██╗██╔════╝██║  ██║██╔══██╗██╔═══██╗██╔══██╗██╔══██╗██╔══██╗ ',
    ' ██║  ██║███████║███████╗███████║██████╔╝██║   ██║███████║██████╔╝██║  ██║ ',
    ' ██║  ██║██╔══██║╚════██║██╔══██║██╔══██╗██║   ██║██╔══██║██╔══██╗██║  ██║ ',
    ' ██████╔╝██║  ██║███████║██║  ██║██████╔╝╚██████╔╝██║  ██║██║  ██║██████╔╝ ',
    ' ╚═════╝ ╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝╚═════╝  ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═════╝  ',
    '',
  }
end

local function week_header(concat, append)
  local week = week_ascii_text()
  local daysoftheweek =
    { 'Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday' }
  local day = daysoftheweek[os.date('*t').wday]
  local tbl = week[day]
  table.insert(tbl, os.date('%Y-%m-%d %H:%M:%S ') .. (concat or ''))
  if append then
    vim.list_extend(tbl, append)
  end
  table.insert(tbl, '')
  return tbl
end

local function generate_header(config)
  if not vim.bo[config.bufnr].modifiable then
    vim.bo[config.bufnr].modifiable = true
  end
  if not config.command then
    local header = config.week_header
        and config.week_header.enable
        and week_header(config.week_header.concat, config.week_header.append)
      or (config.header or default_header())
    api.nvim_buf_set_lines(config.bufnr, 0, -1, false, utils.center_align(header))

    for i, _ in ipairs(header) do
      vim.api.nvim_buf_add_highlight(config.bufnr, 0, 'DashboardHeader', i - 1, 0, -1)
    end
    return
  end

  local empty_table = utils.generate_empty_table(config.file_height + 4)
  api.nvim_buf_set_lines(config.bufnr, 0, -1, false, utils.center_align(empty_table))
  local preview = require('dashboard.preview')
  preview:open_preview({
    width = config.file_width,
    height = config.file_height,
    cmd = config.command .. ' ' .. config.file_path,
  })
end

return {
  generate_header = generate_header,
}
